In [10]:
import pandas as pd
import numpy as np

#### Run python -m pip install pymysql from your terminal to install the mysql client (any folder is fine)

done!

#### cd into your exercises folder for this module and run echo env.py >> .gitignore

done!

#### Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [12]:
from env import user, password, host

In [16]:
def get_db_url(database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

#### Use your function to obtain a connection to the employees database.

In [28]:
# get_db_url('telco')

In [29]:
import env

In [30]:
# env.get_db_url('employees') #not printing out

In [33]:
url = get_db_url('employees')

#### Once you have successfully run a query:

In [34]:
pd.read_sql('select * from employees limit 5', url)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

#### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [38]:
url = get_db_url('employeessssssss')

In [40]:
# pd.read_sql('select * from employees limit 5', url)

#### b. Intentionally make an error in your SQL query. What does the error message look like?

In [42]:
url = get_db_url('employees')

In [45]:
# pd.read_sql('select from employees limit 5', url)

#### Read the employees and titles tables into two separate DataFrames.

In [ ]:
employees = pd.read_sql('select * from employees', url)

In [46]:
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [ ]:
titles = pd.read_sql('select * from titles', url)

In [47]:
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

#### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [48]:
employees.shape

(300024, 6)

In [49]:
titles.shape

(443308, 4)

#### Display the summary statistics for each DataFrame.

In [51]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [52]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

#### How many unique titles are in the titles DataFrame?

In [57]:
titles.title.nunique()

7

In [59]:
len(titles.title.unique())

7

In [60]:
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

#### What is the oldest date in the to_date column?

In [64]:
titles.to_date.min()

datetime.date(1985, 3, 1)

#### What is the most recent date in the to_date column?

In [65]:
titles.to_date.max()

datetime.date(9999, 1, 1)

In [74]:
#if we wanted to filter out the 9999 date
titles [titles.to_date != titles.to_date.max()].to_date.max()

datetime.date(2002, 8, 1)